In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# 7.1 处理缺失数据

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()#检测是否缺失值

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None#Python内置的None值在对象数组中也可以作为NA
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![NA处理方法](http://upload-images.jianshu.io/upload_images/7178691-1a0f73e5bb26ea21.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

## 滤除缺失数据

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()#dropna返回一个仅含非空数据和索引值的Series

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]#等价表达式

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()#dropna默认丢弃DataFrame任何含有缺失值的行
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')#传入how='all'将只丢弃全为NA的那些行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')#丢弃列，只需传入axis=1即可

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.851453       NaN       NaN
1  0.033725       NaN       NaN
2 -1.063440       NaN -0.296289
3 -0.905211       NaN -0.283755
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

In [14]:
df.dropna()

          0         1         2
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

In [17]:
df.dropna(thresh=2)#传入thresh=n保留至少有n个"非NaN数据"的行

          0         1         2
2 -1.063440       NaN -0.296289
3 -0.905211       NaN -0.283755
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

## 填充缺失数据

In [18]:
df.fillna(0)

          0         1         2
0 -0.851453  0.000000  0.000000
1  0.033725  0.000000  0.000000
2 -1.063440  0.000000 -0.296289
3 -0.905211  0.000000 -0.283755
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

In [19]:
df.fillna({1: 0.5, 2: 0})#通过一个字典调用fillna，就可以实现对不同的列填充不同的值

          0         1         2
0 -0.851453  0.500000  0.000000
1  0.033725  0.500000  0.000000
2 -1.063440  0.500000 -0.296289
3 -0.905211  0.500000 -0.283755
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

In [24]:
_=df.fillna(0, inplace=True)
df

          0         1         2
0 -0.851453  0.000000  0.000000
1  0.033725  0.000000  0.000000
2 -1.063440  0.000000 -0.296289
3 -0.905211  0.000000 -0.283755
4 -0.003202 -2.513693  0.344258
5 -0.314972  1.112880 -0.691776
6  0.392798  0.498167  0.873461

>python中下划线主要使用于一下四个场景  
    1.表示最近输出结果  
        !注意：如果_变量被显式赋值了，则_就固定表示这个值，不会动态地表示最近输出的结果  
    2.表示没用的变量  
        两个元素的循环，如果只需要用一个元素，另一个元素最好用_表示，说明这个元素不会被使用，增加代码可读性  
    3.表示私有变量  
        这里是_作为变量名第一个字符出现，表示私有变量，不希望被访问  
    4.前后双下划线————类的魔术方法

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  2.035326 -0.027126 -0.631381
1  0.404990  0.486981  0.473542
2  0.385877       NaN  1.091536
3  1.200275       NaN -0.900300
4  0.238735       NaN       NaN
5 -0.161622       NaN       NaN

In [26]:
df.fillna(method='ffill')#使用ffill可以实现前向值填充

          0         1         2
0  2.035326 -0.027126 -0.631381
1  0.404990  0.486981  0.473542
2  0.385877  0.486981  1.091536
3  1.200275  0.486981 -0.900300
4  0.238735  0.486981 -0.900300
5 -0.161622  0.486981 -0.900300

In [27]:
df.fillna(method='ffill', limit=2)#最多填充2个

          0         1         2
0  2.035326 -0.027126 -0.631381
1  0.404990  0.486981  0.473542
2  0.385877  0.486981  1.091536
3  1.200275  0.486981 -0.900300
4  0.238735       NaN -0.900300
5 -0.161622       NaN -0.900300

In [28]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())#可以传入Series的平均值

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![fillna的参考1](http://upload-images.jianshu.io/upload_images/7178691-0bf235386a64c3b5.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

![fillna的参考1](http://upload-images.jianshu.io/upload_images/7178691-4edd39e68f4dc530.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

# 7.2 数据转换

# 移除重复数据

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()#表示是否重复行

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()#去除重复行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])#只希望根据k1列过滤重复项

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')#默认保留第一个出现的值的组合，传入keep则保留希望保留的数

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 利用函数或映射进行数据转换

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [36]:
lowercased = data['food'].str.lower()#将名字统一为小写
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)#Series的map方法可以接受一个函数或含有映射关系的字典型对象
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
data['food'].map(lambda x: meat_to_animal[x.lower()])#传入lambda函数

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999, np.nan)#可以利用replace来产生一个新的Series（除非传入inplace=True）

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 重命名轴索引

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [45]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [46]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
data.rename(index=str.title, columns=str.upper)#str.title使字符串每个单词首字母大写

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [48]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})#rename可以结合字典型对象实现对部分轴标签的更新

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [49]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)#如果希望就地修改某个数据集，传入inplace=True即可
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 离散化和面元划分

In [50]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [51]:
bins = [18, 25, 35, 60, 100]#面元
cats = pd.cut(ages, bins)#pandas返回的是一个特殊的Categorical对象。结果展示了pandas.cut划分的面元。
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [52]:
cats.codes#codes属性——年龄数据的标签

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [54]:
cats.categories#categories——表示不同分类名称的类型数组

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [55]:
pd.value_counts(cats)#pandas.cut结果的面元计数

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [56]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)#圆括号表示开端，而方括号则表示闭端（包括）。哪边是闭端可以通过right=False进行修改

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [57]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)#传递一个列表或数组到labels，设置自己的面元名称

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [58]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)#如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元。
#选项precision=2，限定小数只有两位。

[(0.49, 0.73], (0.73, 0.97], (0.73, 0.97], (0.25, 0.49], (0.49, 0.73], ..., (0.0046, 0.25], (0.49, 0.73], (0.25, 0.49], (0.0046, 0.25], (0.49, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.0046, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

>qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元

In [59]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-0.744, -0.0637], (0.662, 3.135], (-3.074, -0.744], (-0.0637, 0.662], (-3.074, -0.744], ..., (-3.074, -0.744], (0.662, 3.135], (-0.0637, 0.662], (-0.0637, 0.662], (-3.074, -0.744]]
Length: 1000
Categories (4, interval[float64]): [(-3.074, -0.744] < (-0.744, -0.0637] < (-0.0637, 0.662] < (0.662, 3.135]]

In [60]:
pd.value_counts(cats)

(0.662, 3.135]       250
(-0.0637, 0.662]     250
(-0.744, -0.0637]    250
(-3.074, -0.744]     250
dtype: int64

In [62]:
cats=pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [64]:
cats

[(-1.358, -0.0637], (1.251, 3.135], (-1.358, -0.0637], (-0.0637, 1.251], (-3.074, -1.358], ..., (-1.358, -0.0637], (-0.0637, 1.251], (-0.0637, 1.251], (-0.0637, 1.251], (-3.074, -1.358]]
Length: 1000
Categories (4, interval[float64]): [(-3.074, -1.358] < (-1.358, -0.0637] < (-0.0637, 1.251] < (1.251, 3.135]]

In [65]:
pd.value_counts(cats)

(-0.0637, 1.251]     400
(-1.358, -0.0637]    400
(1.251, 3.135]       100
(-3.074, -1.358]     100
dtype: int64

## 检测和过滤异常值

In [66]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014953    -0.005403    -0.017845    -0.006642
std       1.018223     1.000911     1.010934     1.020031
min      -3.283594    -2.574150    -3.257186    -2.884167
25%      -0.712765    -0.690393    -0.663669    -0.708822
50%      -0.036045    -0.011434     0.016000    -0.028478
75%       0.648509     0.677522     0.650167     0.675737
max       3.354422     3.752645     3.481522     3.181567

In [68]:
col = data[2]
col[np.abs(col) > 3]

461    3.481522
689   -3.257186
Name: 2, dtype: float64

In [79]:
data[(np.abs(data) > 3).any(axis=1)]#要选出全部含有“超过3或－3的值”的行，你可以在布尔型DataFrame中使用any方法

            0         1         2         3
135  3.354422  0.230596 -0.933516 -0.558084
262  0.632588  3.752645  0.596132 -1.129330
403  0.893197 -0.617433 -2.808792  3.181567
461  1.098114  0.401402  3.481522 -0.450674
513 -3.283594 -0.530444 -1.404517 -1.287837
689 -0.382535  0.604755 -3.257186 -0.909911
732  1.097875  3.226093  0.014680  0.012705
925 -0.769471 -1.935614  0.730608  3.034931

In [80]:
data[np.abs(data) > 3] = np.sign(data) * 3#该代码可以将值限制在区间－3到3以内
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015023    -0.006382    -0.018069    -0.006858
std       1.016238     0.997655     1.008585     1.019375
min      -3.000000    -2.574150    -3.000000    -2.884167
25%      -0.712765    -0.690393    -0.663669    -0.708822
50%      -0.036045    -0.011434     0.016000    -0.028478
75%       0.648509     0.677522     0.650167     0.675737
max       3.000000     3.000000     3.000000     3.000000

In [81]:
np.sign(data).head()#根据数据的值是正还是负，np.sign(data)可以生成1和-1

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0  1.0 -1.0  1.0

## 排列和随机采样

In [82]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [83]:
sampler = np.random.permutation(5)#permutation可产生一个表示新顺序的整数数组
sampler

array([0, 3, 4, 1, 2])

In [84]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [85]:
df.sample(n=3)#选取随机子集，不作替换

   0  1   2   3
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7

In [89]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)#随机选取10个子集，这里replace=True不是替换的意思，意思是允许重复选择
draws

2   -1
0    5
3    6
2   -1
4    4
2   -1
3    6
2   -1
4    4
4    4
dtype: int64

## 计算指标/哑变量

In [91]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

>get_dummies功能：如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0）。

In [92]:
pd.get_dummies(df['key'])#使数据离散化

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [93]:
dummies = pd.get_dummies(df['key'], prefix='key')#给指标DataFrame的列加上一个前缀，以便能够跟其他数据进行合并。
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [94]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

c:\program files (x86)\microsoft visual studio\shared\python36_64\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until
c:\program files (x86)\microsoft visual studio\shared\python36_64\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [95]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [96]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [99]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [100]:
gen = movies.genres[0]
gen

"Animation|Children's|Comedy"

In [101]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [102]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [103]:
for i, gen in enumerate(movies.genres):#enumerate——枚举，返回数据下标（i）和数据
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [105]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [106]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [107]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

>一个对统计应用有用的秘诀是：结合get_dummies和诸如cut之类的离散化函数

# 7.3 字符串操作

## 字符串对象方法（Python内置）

In [108]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [109]:
pieces = [x.strip() for x in val.split(',')]#strip——去除空白符（包括换行符）
pieces

['a', 'b', 'guido']

In [110]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [111]:
'::'.join(pieces)#一种更快更符合Python风格的方式是，向字符串"::"的join方法传入一个列表或元组

'a::b::guido'

In [112]:
'guido' in val

True

In [113]:
val.index(',')

1

In [114]:
val.find(':')

-1

In [115]:
val.index(':')#find和index的区别：如果找不到字符串，index将会引发一个异常（而不是返回－1）

ValueError: substring not found

In [116]:
val.count(',')#count可以返回指定子串的出现次数

2

In [117]:
val.replace(',', '::')

'a::b::  guido'

In [118]:
val.replace(',', '')#通过传入空字符串，它也常常用于删除模式

'ab  guido'

![Python内置的字符串方法1](http://upload-images.jianshu.io/upload_images/7178691-087fe67bf6db0701.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

![Python内置的字符串方法1](http://upload-images.jianshu.io/upload_images/7178691-d1f0d4ed3e895016.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

## 正则表达式

In [119]:
import re #regular expression
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)#描述一个或多个空白符的regex是\s+

['foo', 'bar', 'baz', 'qux']

In [120]:
regex = re.compile('\s+')#可以用re.compile自己编译regex以得到一个可重用的regex对象
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [121]:
regex.findall(text)#如果只希望得到匹配regex的所有模式，则可以使用findall方法

['    ', '\t ', '  \t']

>笔记：如果打算对许多字符串应用同一条正则表达式，强烈建议通过re.compile创建regex对象。这样将可以节省大量的CPU时间。

>match和search跟findall功能类似。findall返回的是字符串中所有的匹配项，而search则只返回第一个匹配项。match更加严格，它只匹配字符串的首部。

In [122]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'#正则表达式

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [123]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [124]:
m = regex.search(text)#匹配项对象只能告诉我们模式在原字符串中的起始和结束位置
m

In [125]:
text[m.start():m.end()]

'dave@google.com'

In [126]:
print(regex.match(text))#regex.match则将返回None，因为它只匹配出现在字符串开头的模式

None

In [127]:
print(regex.sub('REDACTED', text))#sub方法可以将匹配到的模式替换为指定字符串，并返回所得到的新字符串

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [128]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
#想将各个地址分成3个部分：用户名、域名以及域后缀,只需将待分段的模式的各部分用圆括号包起来即可
regex = re.compile(pattern, flags=re.IGNORECASE)

In [130]:
m = regex.match('wesm@bright.net')
m

In [131]:
m.groups()#通过其groups方法返回一个由模式各段组成的元组

('wesm', 'bright', 'net')

In [132]:
regex.findall(text)#对于带有分组功能的模式，findall会返回一个元组列表

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [133]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))
#sub还能通过诸如\1、\2之类的特殊符号访问各匹配项中的分组。符号\1对应第一个匹配的组，\2对应第二个匹配的组

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

![正则表达式方法](http://upload-images.jianshu.io/upload_images/7178691-efbb80a793759fc0.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)

## pandas的矢量化字符串函数

In [135]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [136]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

>通过data.map，所有字符串和正则表达式方法都能被应用于（传入lambda表达式或其他函数）各个值，但是如果存在NA（null）就会报错。

>解决方法：Series的str属性能够跳过NA值的面向数组方法

In [137]:
data.str.contains('gmail')#通过str.contains检查各个电子邮件地址是否含有"gmail"

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [138]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [139]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [140]:
matches = data.str.match(pattern, flags=re.IGNORECASE)#返回类型是object，不能访问列表中的元素
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [153]:
data.str.get(1)#获取各元素中的第i（括号内的数字）个字符

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [154]:
data.str[0]#通过下标引用各元素中的第i-1（括号内的数字）个字符

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [152]:
data.str[:5]#利用这种方法对字符串进行截取

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

![部分矢量化字符串方法](http://upload-images.jianshu.io/upload_images/7178691-a634364ed6d5d5c5.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240)